fabrika/src/Documents/КорректировкаОплатГТД/КорректировкаОплатГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаОплатГТД</name>
  <registerRecords>AccumulationRegister.ТаможняОплатаГТД</registerRecords>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ПриходМашины</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодИнвойсНомер</name>
    <comment>ПодИнвойс номер</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

fabrika/src/AccumulationRegisters/ТаможняОплатаГТД/ТаможняОплатаГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТаможняОплатаГТД</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипДвижения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ПриходМашины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодИнвойсНомер</name>
    <comment>ПодИнвойс номер</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fabrika/src/Documents/КорректировкаОплатГТД/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Обнуление доступного остатка
	Движения.ТаможняОплатаГТД.Записывать = Истина;
	Движение = Движения.ТаможняОплатаГТД.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.ГТД = ГТД;
	Движение.ПодИнвойсНомер = ПодИнвойсНомер;
	Движение.Сумма = Остаток;
	Движение.ТипДвижения = "Корректировка остатка по машине";
	
	// регистр ТаможняОплатаГТД Приход
	Движение = Движения.ТаможняОплатаГТД.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ГТД = ГТД;
	Движение.ПодИнвойсНомер = ПодИнвойсНомер;
	Движение.Сумма = СуммаКорректировки;
	Движение.ТипДвижения = "Корректировка остатка по машине";
	
КонецПроцедуры
